app/views/carts/_cart.html.erb

<% unless @cart.cart_items.empty? %>
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = 10
SELECT COUNT(*) FROM "cart_items" WHERE "cart_items"."cart_id" = 31