app/controllers/cart_items_controller.rb

SELECT "cart_items".* FROM "cart_items"
---
  def index
    @cart_items = CartItem.all

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @cart_item = CartItem.find(params[:id])

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @cart_item = CartItem.find(params[:id])

SELECT "products".* FROM "products" WHERE "products"."id" = ? ORDER BY title LIMIT 1  [["id", "2"]]
INSERT INTO "cart_items" ("cart_id", "created_at", "order_id", "product_id", "quantity", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["cart_id", 30], ["created_at", Sat, 30 Mar 2013 23:51:52 UTC +00:00], ["order_id", nil], ["product_id", 2], ["quantity", 1], ["updated_at", Sat, 30 Mar 2013 23:51:52 UTC +00:00]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Sun, 17 Mar 2013 20:56:16 UTC +00:00], ["updated_at", Sun, 17 Mar 2013 20:56:16 UTC +00:00]]
UPDATE "cart_items" SET "quantity" = 2, "updated_at" = '2013-03-17 21:46:10.323739' WHERE "cart_items"."id" = 3
---
  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @cart_item = @cart.add_product(product.id)
    #@cart_item = CartItem.new(params[:cart_item])

    respond_to do |format|
      if @cart_item.save

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def update
    @cart_item = CartItem.find(params[:id])

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT 1  [["id", "980190962"]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 980190962]]
---
  def destroy
    @cart_item = CartItem.find(params[:id])
    @cart_item.destroy