app/controllers/carts_controller.rb

SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", "7"]]
---
  def show

    begin
      @cart = Cart.find(params[:id])

SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", "7"]]
---
  def edit
    @cart = Cart.find(params[:id])

INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Sun, 17 Mar 2013 21:09:29 UTC +00:00], ["updated_at", Sun, 17 Mar 2013 21:09:29 UTC +00:00]]
---
  def create
    @cart = Cart.new(params[:cart])

    respond_to do |format|
      if @cart.save

SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def update
    @cart = Cart.find(params[:id])

DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 7]]
---
  def destroy
    @cart = current_cart
    @cart.destroy