app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show

    @cart = current_cart
    @order = Order.find(params[:id])

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = 30
SELECT COUNT(*) FROM "cart_items" WHERE "cart_items"."cart_id" = 30
---
  def new

    @cart = current_cart

    if @cart.cart_items.empty?

INSERT INTO "orders" ("created_at", "email", "name", "pay_type", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 31 Mar 2013 00:05:37 UTC +00:00], ["email", "pegorari@gmail.com"], ["name", "Rodrigo"], ["pay_type", ""], ["updated_at", Sun, 31 Mar 2013 00:05:37 UTC +00:00]]
---
  def create
    @order = Order.new(params[:order])

    respond_to do |format|
      if @order.save